class Unit:
    def __init__(self, name, health, defense, attack):
        self.name = name
        self.health = health
        self.defense = defense
        self.attack = attack

# Список всех типов юнитов
unit_types = {
    "Дунны": Unit("Дунны", 3, 0, 1),
    "Рунны": Unit("Рунны", 3, 0, 1),
    "Свартаальхи": Unit("Свартаальхи", 3, 0, 1),
    "Альхи": Unit("Альхи", 3, 0, 1),
    "Гномы": Unit("Гномы", 4, 0, 1),
    "Орки": Unit("Орки", 4, 1, 2),
    "Ящеролюды": Unit("Ящеролюды", 4, 0, 1),
    "Сатиры": Unit("Сатиры", 3, 0, 1),
    "Древние": Unit("Древние", 4, 0, 1),
    "Баргесты": Unit("Баргесты", 4, 1, 2),
    "Трогглодиты": Unit("Трогглодиты", 3, 2, 2),
    "Кентавры": Unit("Кентавры", 4, 0, 2)
}